# IPhotoRenderContext Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IPhotoRenderContext Methods
IPhotoRenderContext Interface See Also
---
The IPhotoRenderContext type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Finish | This method is called at the very end of the export process, after all entities were processed (or after the process was cancelled).  (Inherited from IExportContext.) |
| IsCanceled | This method is queried at the beginning of every element.  (Inherited from IExportContext.) |
| OnElementBegin | This method marks the beginning of an element to be exported.  (Inherited from IExportContext.) |
| OnElementEnd | This method marks the end of an element being exported.  (Inherited from IExportContext.) |
| OnFaceBegin | This method marks the beginning of a Face to be exported.  (Inherited from IExportContext.) |
| OnFaceEnd | This method marks the end of the current face being exported.  (Inherited from IExportContext.) |
| OnInstanceBegin | This method marks the start of processing of an instance node (e.g. a family instance).  (Inherited from IExportContext.) |
| OnInstanceEnd | This method marks the end of processing of an Instance Node (e.g. a family instance).  (Inherited from IExportContext.) |
| OnLight | This method marks the beginning of export of a light which is enabled for rendering.  (Inherited from IExportContext.) |
| OnLinkBegin | This method marks the beginning of a link instance to be exported.  (Inherited from IExportContext.) |
| OnLinkEnd | This method marks the end of a link instance being exported.  (Inherited from IExportContext.) |
| OnMaterial | This method marks a change of the material.  (Inherited from IExportContext.) |
| OnPolymesh | This method is called when a tessellated polymesh of a 3d face is being output.  (Inherited from IExportContext.) |
| OnRPC | This method marks the beginning of export of an RPC object.  (Inherited from IExportContext.) |
| OnViewBegin | This method marks the beginning of a 3D view to be exported.  (Inherited from IExportContext.) |
| OnViewEnd | This method marks the end of a 3D view being exported.  (Inherited from IExportContext.) |
| Start | This method is called at the very start of the export process, still before the first entity of the model was send out.  (Inherited from IExportContext.) |

# See Also
IPhotoRenderContext Interface
Autodesk.Revit.DB Namespace